sebailfico/sono-loco/esp32-code/src/main.cpp
    initI2SForClient();
    if (!clientI2SActive) {
        LOG_ERROR("CLIENT I2S unavailable — returning to DISCOVERY");
#ifdef ENABLE_BLUETOOTH
        if (!benchMode) startBluetooth();
#endif
        // Back off before retrying. The server keeps broadcasting, so rxActive
        // is set again within milliseconds; without this the node would retry
        // every loop pass and thrash BT stop/start indefinitely.
        clientRetryAfterMs = millis() + CLIENT_RETRY_BACKOFF_MS;
        currentMode = MODE_DISCOVERY;
        return;
    }

    currentMode = MODE_CLIENT;
    LOG_INFO("Free heap: " + String(ESP.getFreeHeap()) + " bytes");
}

// ============================================================================
// Bench mode — synthetic source, telemetry, serial control
// ============================================================================

static int64_t  benchStartUs      = 0;   // when this node started sourcing
static uint32_t benchPktIdx       = 0;   // packets that should have been sent by now
static uint32_t benchSampleIdx    = 0;   // running sample index, for a continuous tone
static uint32_t benchTxPackets    = 0;   // packets actually queued
static unsigned long benchLastReportMs = 0;

/**
 * Generate the test stream.
 *
 * Paced off `esp_timer_get_time()` rather than millis()/micros(): it is a 64-bit
 * microsecond counter, so it does not wrap at 71 minutes in the middle of a long
 * drift measurement. The due time for each packet is computed from the packet
 * index against the start time, not by adding an interval each pass, so rounding
 * cannot accumulate into exactly the drift we are trying to measure.
 */
static void benchServiceSource() {
    if (!benchSource || !espnowActive || txQueue == nullptr) return;

    const uint32_t samplesPerPkt = ESPNOW_PAYLOAD_SIZE / 2;
    const int64_t  now           = esp_timer_get_time();

    // Bounded catch-up: if this node was blocked for a while, send a few packets
    // back to back but never sit here spinning out a whole backlog.
    for (int burst = 0; burst < BENCH_MAX_CATCHUP_PKTS; burst++) {
        const int64_t due = benchStartUs +
            (int64_t)benchPktIdx * 1000000LL * (int64_t)samplesPerPkt / CLIENT_SAMPLE_RATE;
        if (now < due) return;

        AudioPacket pkt;
        pkt.seq = txSeq++;
        pkt.len = ESPNOW_PAYLOAD_SIZE;
        for (uint32_t i = 0; i < samplesPerPkt; i++) {
            const float t = (float)(benchSampleIdx + i) / CLIENT_SAMPLE_RATE;
            const int16_t s =
                (int16_t)(BENCH_TONE_AMPLITUDE * sinf(2.0f * M_PI * BENCH_TONE_HZ * t));
            memcpy(pkt.data + i * 2, &s, 2);
        }
        benchSampleIdx += samplesPerPkt;

        if (xQueueSend(txQueue, &pkt, 0) != pdTRUE) txQueueFull++;
        else                                        benchTxPackets++;
        benchPktIdx++;
    }
}

static void benchStartSource() {
    if (!espnowActive) {
        DEBUG_SERIAL.println("[BENCH] error reason=espnow_inactive");
        return;
    }
    benchStartUs   = esp_timer_get_time();
    benchPktIdx    = 0;
    benchSampleIdx = 0;
    benchTxPackets = 0;
    txQueueFull = txSendErr = txRadioFail = 0;
    benchSource    = true;
    currentMode    = MODE_SERVER;   // stops this node treating its own role as a listener
    DEBUG_SERIAL.printf("[BENCH] source start rate=%d hz=%d amp=%d\n",
                        CLIENT_SAMPLE_RATE, BENCH_TONE_HZ, BENCH_TONE_AMPLITUDE);
}

static void benchStopSource() {
    benchSource = false;
    DEBUG_SERIAL.printf("[BENCH] source stop tx=%lu\n", (unsigned long)benchTxPackets);
    enterDiscovery();
}

/**
 * One machine-parsable line per interval, in every mode, with every field
 * present whether or not it applies. `ms` is this node's own clock: the host
 * regresses it against PC time to get each board's ppm error, and the difference
 * between two boards is their relative drift.
 *
 * printf, not String concatenation — this runs once a second forever and the
 * String version fragments the heap.
 */
static void benchReport() {
    const char *modeStr = currentMode == MODE_DISCOVERY ? "DISCOVERY"
                        : currentMode == MODE_SERVER    ? "SERVER"
                                                        : "CLIENT";
    DEBUG_SERIAL.printf(
        "[BENCH] ms=%lu role=%s mode=%s heap=%lu jit=%d rx=%lu lost=%lu ovf=%lu "
        "und=%lu dup=%lu rsy=%lu tx=%lu qfull=%lu senderr=%lu radiofail=%lu\n",
        (unsigned long)millis(),
        benchSource ? "SOURCE" : "SINK",
        modeStr,
        (unsigned long)ESP.getFreeHeap(),
        jbuf.fill(),
        (unsigned long)rxCount,
        (unsigned long)seqTracker.lost,
        (unsigned long)rxOverflow,
        (unsigned long)rxUnderrun,
        (unsigned long)seqTracker.dupe,
        (unsigned long)seqTracker.resync,
        (unsigned long)benchTxPackets,
        (unsigned long)txQueueFull,
        (unsigned long)txSendErr,
        (unsigned long)txRadioFail);
}

static void benchIdentify() {
    uint8_t mac[6] = {0};
    esp_read_mac(mac, ESP_MAC_WIFI_STA);
    DEBUG_SERIAL.printf(
        "[BENCH] id chip=%s psram=%lu mac=%02X:%02X:%02X:%02X:%02X:%02X "
        "bench=%d bt=%d espnow=%d name=%s\n",
        ESP.getChipModel(),
        (unsigned long)ESP.getPsramSize(),
        mac[0], mac[1], mac[2], mac[3], mac[4], mac[5],
        benchMode ? 1 : 0,
#ifdef ENABLE_BLUETOOTH
        1,
#else
        0,
#endif
        espnowActive ? 1 : 0,
        ROOM_NAME);
}

/**
 * Single-character commands, so the host side needs no protocol.
 *
 *   ?  identify          b  reboot into bench mode     n  reboot into normal mode
 *   s  start sourcing    x  stop sourcing              r  report now
 */
static void benchServiceSerial() {
    while (DEBUG_SERIAL.available()) {
        switch (DEBUG_SERIAL.read()) {
            case '?': benchIdentify(); break;
            case 'r': benchReport();   break;
            case 's': benchStartSource(); break;
            case 'x': benchStopSource();  break;
            case 'b':
                benchMagic = BENCH_MAGIC;
                DEBUG_SERIAL.println("[BENCH] rebooting into bench mode");
                DEBUG_SERIAL.flush();
                delay(50);
                ESP.restart();
                break;
            case 'n':
                benchMagic = 0;
                DEBUG_SERIAL.println("[BENCH] rebooting into normal mode");
                DEBUG_SERIAL.flush();
                delay(50);
                ESP.restart();
                break;
            default: break;   // ignore newlines and anything unrecognised
        }
    }
}

// ============================================================================
// Setup
// ============================================================================

void setup() {
    DEBUG_SERIAL.begin(DEBUG_BAUD_RATE);
    delay(1000);

    DEBUG_SERIAL.println();
    DEBUG_SERIAL.println("================================");
    DEBUG_SERIAL.println("  SonoLoco — Multi-Room Audio");
#ifdef ENABLE_BLUETOOTH
    DEBUG_SERIAL.println("  Mode: SERVER capable (BT + ESP-NOW)");
#else
    DEBUG_SERIAL.println("  Mode: CLIENT only (ESP-NOW)");
#endif
    DEBUG_SERIAL.println("================================");
    DEBUG_SERIAL.println();

